---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelSetOffset
source: html/85d170b7-facc-fb3b-22eb-21aabe4754ca.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelSetOffset Property

"Alignment Station Label Set Offset": The text is not used directly anywhere in the UI,
 instead the XAML specifies its own string for the value's label.

## Syntax (C#)
```csharp
public static ForgeTypeId AlignmentStationLabelSetOffset { get; }
```